<?php include ("app/include/header.php"); ?>
<!--Block Main-->
<div class="container">
    <div class="content row">
        <div class="main-content col-md-9 col-12">
            <h2>Створення сайтів та додатків на PHP</h2>
                <div class="single_post row">
                    <div class="img col-12">
                        <img src="assets/res/db.png" alt="" class="img-thumbnail">
                    </div>
                    <div class="info">
                        <i class="far fa-user">Ім'я автора</i>
                        <i class="far fa-calendar">Mar 11, 2019</i>
                    </div>
                    <div class="single_post_text col-12">
                        <h3>Чому PHP?</h3>
                        <h5>Універсальність.</h5> <p>Мова програмування PHP — крос-платформна, що дозволяє створювати і використовувати PHP програми та файли на різних операційних системах.
                            Безкоштовне поширення. Проекти на PHP мають відкритий вихідний код, а значить, доступні для розробників з усього світу.</p>
                        <h5>Гнучкість і потужність.</h5> <p>На PHP побудовано багато CMS (Сontent management system) і фреймворків — це відмінний приклад гнучкості і потужності. Цією мовою написані такі популярні фреймворки як Laravel, Symfony, Yii, а також CMS Drupal, Magento, WordPress, якими активно користуються веб-розробники, і які отримали визнання у всьому світі. Оскільки РНР — це скриптова мова, то вона відрізняється надзвичайною гнучкістю щодо потреб веб-розробника. Більш того, варто відзначити, що добре структуровані додатки РНР легко розширюються в міру потреби.</p>
                        <h5>Простота.</h5> <p>Фундаментальна перевага PHP перед іншими мовами, які використовуються в веб-технологіях — це простота: вона легка в освоєнні на всіх етапах розробки проекту. Веб-розробники без проблем можуть швидко створювати динамічні сторінки і системи різної складності, які орієнтовані на вирішення різноманітних задач.</p>
                        <h5>Спільнота.</h5> <p>Має хорошу підтримку спільноти <a href="#">програмістів</a></p>
                        <h5>Продуктивність.</h5> <p>При правильній архітектурі проекти можна оптимізувати під великі навантаження, навіть понад 1 мільярд користувачів в день. Однією з переваг PHP вважається підтримка широкого кола БД. Створити скрипт, який буде використовувати БД — дуже просто. Для цього можна використовувати розширення для окремої бази даних (таке як MySQL), під’єднатися до будь-якої БД за допомогою розширення ODBC і т.д.</p>
                        <h5>Додатки.</h5> <p>За допомогою використання мови програмування PHP було розроблено велику кількість додатків, які застосовуються в різних соціальних мережах, порталах та інтернет-магазинах:
                        <ul>
                            <li>системи для проектів e-commerce, наприклад, OpenCart, Magento і т.д .;</li>
                            <li>CMS, наприклад, Drupal та WordPress;</li>
                            <li>форумні движки, такі як, phpBB, Invision Power Board, SMF;</li>
                            <li>утиліти адміністрування СУБД, наприклад, phpMyAdmin, phpPgAdmin, Adminer;</li>
                            <li>галереї зображень, наприклад, 4images і Gallery Project;</li>
                            <li>вікі-движки — MediaWiki і DokuWiki.</li></p>
                        </ul>
                    </div>
                </div>
        </div>
        <div class="sidebar col-md-3 col-12">
            <div class="section search">
                <h3>Пошук</h3>
                <form action="#" method="post">
                    <input type="text" name="search-term" class="text-input" placeholder="Search...">
                </form>
            </div>
            <div class="section topics">
                <h3>Topics</h3>
                <ul>
                    <li><a href="#">PHP</a></li>
                    <li><a href="#">HTML</a></li>
                    <li><a href="#">CSS</a></li>
                    <li><a href="#">MySQL</a></li>
                    <li><a href="#">Алгоритми</a></li>
                    <li><a href="#">Налаштування софту</a></li>
                </ul>
            </div>
        </div>
    </div>
</div>
<!--Block MAin end-->
<?php include ("app/include/footer.php"); ?>